/*******************************************************************************
 * 文件名:download.c
 * 文件描述:
 * 创建日期:2018/04/18 10:03:58
 * 版本：Ver1.0
 *
 * Copyright © 2018 - 2018 mengqp.
 *
 * 历史版本：
 * 修改人                修改时间                修改版本        修改内容
 *
 *
 ******************************************************************************/

#include "download.h"

/*******************************************************************************
 * 函数名:download_func
 * 功能描述:采集数据的功能
 * 参数:void
 * 被调用:_start_download
 * 返回值:static void
 ******************************************************************************/
static void  download_func (void)
{
    while ( 1 )
    {
        sleep( 10 );
    }
}   /*-------- end download_func  -------- */

/*******************************************************************************
 * 函数名:_start_download
 * 功能描述:启动下行链路进程
 * 参数:void
 * 被调用:失败返回FAIL 成功返回SUCCESS
 * 返回值:status_t
 ******************************************************************************/
status_t  _start_download(void)
{
    pid_t pid = -1;

    pid = fork();
    if (-1 == pid)
    {
        return FAIL;
    }
    else if (0 == pid)
    {
        download_func();
    }
    else
    {
        //
    }

    return SUCCESS;

}   /*-------- end _start_download -------- */
