/*******************************************************************************
 * 文件名:up.c
 * 文件描述：见头文件
 * 创建日期:2018/04/18 10:05:54
 * 版本：Ver1.0
 *
 * Copyright © 2018 - 2018 mengqp.
 *
 * 历史版本：
 * 修改人                修改时间                修改版本        修改内容
 *
 *
 ******************************************************************************/
#include "up.h"

/*******************************************************************************
 * 函数名:upload_func
 * 功能描述:上传数据的功能函数
 * 参数:void
 * 被调用:_start_upload
 * 返回值:void
 ******************************************************************************/
static void upload_func (void)
{
    while ( 1 )
    {
        sleep( 10 );
    }
}   /*-------- end upload_func  -------- */

/*******************************************************************************
 * 函数名:_start_upload
 * 功能描述:启动上行链路进程
 * 参数:void
 * 被调用:失败返回FAIL 成功返回SUCCESS
 * 返回值:status_t
 ******************************************************************************/
status_t  _start_upload(void)
{
    pid_t pid = -1;

    pid = fork();
    if (-1 == pid)
    {
        return FAIL;
    }
    else if (0 == pid)
    {
        upload_func();
    }
    else
    {
    }

    return SUCCESS;

}   /*-------- end _start_upload -------- */
