/*******************************************************************************
*
*	Modify Record:
*	  <date>		 <author>		<version>		<desc>
*	--------------------------------------------------------------------------
*	2012/08/08		sunhaifeng		  v1.0			Create
*
*
*
*******************************************************************************/

#ifndef __USART_H__
#define __USART_H__

////////////////////////////////////////////////////////////////////////////////
// 头文件
#include "datatype.h"

////////////////////////////////////////////////////////////////////////////////
// 全局宏定义

////////////////////////////////////////////////////////////////////////////////
// 全局数据类型及数据结构定义
typedef struct
{
	u32_t band_rate;
	u08_t data_bits;
	u08_t odd_even;
	u08_t stop_bits;
}usart_param_t;

////////////////////////////////////////////////////////////////////////////////
// 全局函数声明
status_t open_usart(const char *pdev_name, s32_t *psp_fd);
status_t set_usart_attr(s32_t sp_fd, u32_t band_rate, u08_t data_bits, u08_t odd_even, u08_t stop_bits);
void close_usart(s32_t psp_fd );


#endif	// #ifndef __USART_H__
